Documents/упЗаданиеНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаданиеНаПеревозкуГруза</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЗаявкиКВыполнению</xr:Item>
				<xr:Item>AccumulationRegister.упСостояниеПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упПараметрыЗаданияНаПеревозку</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упПараметрыЗаявкиНаПеревозку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспортныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПогрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРазгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыАдресаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыАдресаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКИС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноИсполнениеНесколькимиРейсами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГрузов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВЦепиПоставок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВЦепиПоставокКонец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГруз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлениеГрузаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлениеГрузаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеГрузаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеГрузаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПриоритетыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИнкассацииПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяОперация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упЗаявкиКВыполнению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упЗаявкиКВыполнению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СхемаМультимодальнойПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСхемыМультимодальныхПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВЦепиПоставок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВЦепиПоставокКонец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/упСостояниеПоЗаданиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упСостояниеПоЗаданиям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упЗаданиеНаПеревозкуГруза/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ОтправлениеГрузаС  = ОбъектКопирования.ОтправлениеГрузаС;
	ОтправлениеГрузаПо = ОбъектКопирования.ОтправлениеГрузаПо;
	ПолучениеГрузаС    = ОбъектКопирования.ПолучениеГрузаС;
	ПолучениеГрузаПо   = ОбъектКопирования.ПолучениеГрузаПо;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидТранспортнойУслуги) Тогда
		упУправленияЗаявками.ЗаполнитьВидТранспортнойУслуги(ЭтотОбъект);
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
		
	ТекущийСтатус = Неопределено;
	Если ДополнительныеСвойства.Свойство("Статус", ТекущийСтатус) Тогда 
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Если ТекущийСтатус = Перечисления.упСтатусыЗаданияНаПеревозкуГруза.КПланированию Тогда
			Если НЕ ЗначениеЗаполнено(ЗаявкаНаПеревозкуГруза) Тогда
				ЗапрещеноОформлениеЗаданияНаПеревозкуБезЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПеревозки, "ЗапрещеноОформлениеЗаданияНаПеревозкуБезЗаявки");
				Если ЗапрещеноОформлениеЗаданияНаПеревозкуБезЗаявки Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана заявка. В виде перевозки включена опция ""Запрещено оформление задания на перевозку без заявки""'"), ЭтотОбъект, "ЗаявкаНаПеревозкуГруза",, Отказ);	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Если Истина
		И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И ВидТранспортнойУслуги = Перечисления.упВидыТранспортныхУслуг.ПеревозкаГрузов
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ГрузМодифицирован", Ложь)
	Тогда
		упУправленияЗаявками.ЗаполнитьГрузовыеМеста(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		упУправленияЗаявками.ПроконтролироватьИспользованиеТары(ГрузовыеМеста, Отказ);
	КонецЕсли;
	
	ПроверитьСовместимостьВидовПеревозок(РежимЗаписи, ТекущийСтатус, Отказ);
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПеревозки, "ПараметрыВводаИнформацииОГрузовыхМестах");
	ФормироватьПоГрузовымМестам = упУправленияЗаявками.ФормироватьПоГрузовымМестамПоПараметруВводаИнформации(ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию);
		
	Если ЗначениеЗаполнено(ЗаявкаНаПеревозкуГруза) Тогда
		ПараметрыВводаИнформацииОГрузовыхМестах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаПеревозкуГруза, "ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах");
	Иначе
		ПараметрыВводаИнформацииОГрузовыхМестах = ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию;
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("ПараметрыВводаИнформацииОГрузовыхМестах", ПараметрыВводаИнформацииОГрузовыхМестах);
	ДополнительныеСвойства.Вставить("ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию", ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию);
	ДополнительныеСвойства.Вставить("ФормироватьПоГрузовымМестам", ФормироватьПоГрузовымМестам);
	
	Если Не (ЗначениеЗаполнено(ТекущийСтатус) И ТекущийСтатус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отменена) Тогда
		сткВозврат = упРасчетПоказателейЗагрузки.РассчитатьИтоговыеПараметрыПоНаборуГрузов(ГрузовыеМеста.Выгрузить(, "ГрузовоеМесто, Тара, КоличествоГрузов"), ЗаявкаНаПеревозкуГруза, Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткВозврат);
		ДополнительныеСвойства.Вставить("СтруктураИтоговыхПараметров", сткВозврат);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		упРаботаСоСтатусами.ЕстьДругиеРегистраторыИзменявшиеСтатус(Ссылка, Отказ);
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упЗаявкаНаПеревозкуГруза") Тогда
		Отказ = Ложь;
		ТекстСообщения = "";
		Документы.упЗаявкаНаПеревозкуГруза.СформироватьЗаданияНаПервозкуГруза(ДанныеЗаполнения, ЭтотОбъект, Ложь, ТекстСообщения ,Отказ);
		Если Отказ Тогда
			ДополнительныеСвойства.Вставить("ОшибкаПриЗаполнении", Отказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	РеквизитыОбъекта = Новый Структура("Дата, ЗаявкаНаПеревозкуГруза, ГрузовыеМеста, ФормироватьПоГрузовымМестам, АдресОтправления, АдресПолучения, 
	                                   |ПараметрыВводаИнформацииОГрузовыхМестах, ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию, НомерВЦепиПоставок, 
								|НомерВЦепиПоставокКонец, Отправитель, Получатель, ГрафикРаботыАдресаОтправления, ГрафикРаботыАдресаПолучения, Рейс");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ДополнительныеСвойства, "ПараметрыВводаИнформацииОГрузовыхМестах, ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию, ФормироватьПоГрузовымМестам"); 
	
	БлокировкаДанных = Новый БлокировкаДанных;
		
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЗаявкиКВыполнению");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Заявка", ЗаявкаНаПеревозкуГруза);
		
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЗаданияКПланированию");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Задание", Ссылка);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упСостояниеПоЗаданиям");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Задание", Ссылка);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаявокНаПеревозкуГруза");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Документ", ЗаявкаНаПеревозкуГруза);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаданийНаПеревозкуГруза");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	
	Если ЗначениеЗаполнено(ЗаявкаНаПеревозкуГруза) Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПараметрыЗаявкиНаПеревозку");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаНаПеревозку", ЗаявкаНаПеревозкуГруза);
	КонецЕсли;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПараметрыЗаданияНаПеревозку");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ЗаданиеНаПеревозку", Ссылка);
		
	Рейс = упЗаданиеНаПеревозку.РейсЗадания(Ссылка, ДополнительныеСвойства, РеквизитыОбъекта);
	РеквизитыОбъекта.Рейс = Рейс;
	
	Если Ложь Тогда // Для контекстной подсказки
	    Рейс = Документы.упРейс.ПустаяСсылка();
    КонецЕсли;
    
	Если ЗначениеЗаполнено(Рейс) Тогда
		Рейс.ПолучитьОбъект().ДобавитьЭлементыБлокировкиДанныхПроведения(БлокировкаДанных);
		Если ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упИзмененияРейсов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		КонецЕсли; 
	КонецЕсли; 
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("КонтролироватьЗаявки", Ложь);										
	ДополнительныеСвойства.Вставить("КонтролироватьЗадания", Ложь);										
	ДополнительныеСвойства.Вставить("КонтролироватьСостояниеЗадания", Ложь);
	ДополнительныеСвойства.Вставить("ДобавлятьДвиженияПриОтменеЗадания", Ложь);
	ДополнительныеСвойства.Вставить("СохранятьДвиженияЗаданияКВыполнению", Ложь);
	ДополнительныеСвойства.Вставить("ЗаявкиНаПеревозкуГрузаПоКоторымИзменилсяСтатус", Новый Массив); 
	ДополнительныеСвойства.Вставить("ЭтоПолноправныйПользователь", Пользователи.ЭтоПолноправныйПользователь());
	ДополнительныеСвойства.Вставить("ДоступнаРольСогласованиеЗаявкиНаПеревозкуГруза", РольДоступна("упСогласованиеЗаявкиНаПеревозкуГруза"));
	ДополнительныеСвойства.Вставить("ДоступнаРольОтменаЗаданийНаПеревозкуГруза", РольДоступна("упОтменаЗаданияНаПеревозкуГруза"));

	// Предварительная установка статуса										
	упРаботаСоСтатусами.УстановкаСтатуса(ДополнительныеСвойства, Ссылка, Отказ);
	
	Если ДополнительныеСвойства.Статус = Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Отменено Тогда
		текОтказ = Ложь;
		
		// Ситуация когда задание было включено в рейс, но по какой то проблеме не было не доставлено.
		// В этом случае некорректно очищать движения по заданию.
		//   так как это нарушает хронологическую последовательность действий.
		Если упРаботаСоСтатусами.ЕстьДругиеРегистраторыИзменявшиеСтатус(Ссылка, текОтказ, Ложь) Тогда
		    
			// Если отмененный документ повторно проводится.
			ДополнительныеСвойства.Вставить("СохранятьДвиженияЗаданияКВыполнению",	Истина); 
			
			Если ДополнительныеСвойства.ТекущийСтатус <> ДополнительныеСвойства.Статус Тогда 
		    		ДополнительныеСвойства.Вставить("ДобавлятьДвиженияПриОтменеЗадания",	Истина);	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыОбъекта.Дата = Документы.упЗаданиеНаПеревозкуГруза.ОпределитьПериодФормированияДвижений(Ссылка, РеквизитыОбъекта.ПараметрыВводаИнформацииОГрузовыхМестахПоЗаданию, ДополнительныеСвойства.Статус, ЧасовойПояс);
	
	упЗаданиеНаПеревозку.СформироватьДвижениеЗаявкиКВыполнению(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.СформироватьДвиженияСостояниеПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.СформироватьДвиженияПланПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.СформироватьДвиженияЗаданиеКПланированию(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.СформироватьДвиженияСтатусЗадания(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	ДополнительныеСвойства.Вставить("ПараметрыНаПеревозку", упРасчетПоказателейЗагрузки.РассчитатьТаблицуПараметровГрузовДляПроведения(ДополнительныеСвойства, Ссылка, РеквизитыОбъекта, Отказ));
	упЗаданиеНаПеревозку.СформироватьДвиженияПараметрыЗаявкиНаПеревозку(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.СформироватьДвиженияПараметрыЗаданияНаПеревозку(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	Движения.Записать();
	
	упУправленияЗаявками.ПроконтролироватьОграничениеПоУровнямВложенностиГрузов(Ссылка, Отказ);
	
	упЗаданиеНаПеревозку.ИнициироватьОбновлениеРаботПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Если Отказ Тогда 
		// Неявная транзакция записи уже может быть сломана, поэтому при дальнейнем обращении к БД может быть ошибка "В данной транзакции уже происходили ошибки"
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОбъекта.ЗаявкаНаПеревозкуГруза) Тогда
		ДополнительныеСвойства.Вставить("РассчитатьСтатус", Истина);
		ДополнительныеСвойства.Вставить("ЗаписыватьСтатус", Ложь);
		ДополнительныеСвойства.Вставить("Статус", упРаботаСоСтатусами.ПолучитьТекущийСтатус(РеквизитыОбъекта.ЗаявкаНаПеревозкуГруза));
		упУправленияЗаявками.СформироватьДвиженияСтатусЗаявки(ДополнительныеСвойства, РеквизитыОбъекта.ЗаявкаНаПеревозкуГруза, Движения, РеквизитыОбъекта, Отказ);	
	Иначе
		упЗаданиеНаПеревозку.ЗаписатьАдресаПартнеров(ДополнительныеСвойства, РеквизитыОбъекта);
	КонецЕсли;
		
	Если ДополнительныеСвойства.КонтролироватьЗаявки Тогда
		упУправленияЗаявками.ПроконтролироватьЗаявкиКВыполнению(ЗаявкаНаПеревозкуГруза, Отказ, Ссылка);
	КонецЕсли;
	
	Если ДополнительныеСвойства.КонтролироватьСостояниеЗадания Тогда
		упЗаданиеНаПеревозку.ПроконтролироватьСостояниеЗадания(Ссылка, Отказ);
	КонецЕсли;	

	упЗаданиеНаПеревозку.ПроконтролироватьЗаданияКПланированию(Ссылка, РеквизитыОбъекта.ФормироватьПоГрузовымМестам, Отказ, ДополнительныеСвойства);
		
	Если ЗначениеЗаполнено(РеквизитыОбъекта.Рейс) Тогда
		ДополнительныеСвойства.Вставить("ОбновитьМаршрутНаМК", Истина);
		упКорректировкаМаршрута.СформироватьДвиженияИзмененияРейсов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСовместимостьВидовПеревозок(РежимЗаписи, ТекущийСтатус, Отказ)
	
	Если Истина
		И Не Отказ
		И НЕ ПометкаУдаления 
		И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И ТекущийСтатус <> Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Отменено
		И ТекущийСтатус <> Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Новое
		И ЗначениеЗаполнено(ЗаявкаНаПеревозкуГруза)
	Тогда
		РеквизитыОбъекта = Новый Структура();
		РеквизитыОбъекта.Вставить("ОбъектПроверки", Ссылка);
		РеквизитыОбъекта.Вставить("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);
		РеквизитыОбъекта.Вставить("ВидПеревозки", ВидПеревозки);
		
		Отказ = Не Справочники.упВидыПеревозок.ВидыПеревозокСовместимы(РеквизитыОбъекта); 
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РеквизитыОбъекта.ТекстСообщения,ЭтотОбъект,,,Отказ);
			ЗаписьЖурналаРегистрации(Документы.упЗаданиеНаПеревозкуГруза.СобытиеЖРПроверкаСовместимостиВидовПеревозок(),
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				РеквизитыОбъекта.ТекстСообщения,
				РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
